faronov/efr32mg1p-zigbee-sensor/app.c
static void app_flash_probe(void)
{
  app_flash_enable_init();

  static bool spidrv_inited = false;
  if (!spidrv_inited) {
    if (sl_spidrv_exp_init != NULL) {
      sl_spidrv_exp_init();
    } else if (sl_spidrv_init_instances != NULL) {
      sl_spidrv_init_instances();
    } else {
      APP_DEBUG_PRINTF("SPI flash: SPIDRV init symbol missing\n");
    }
    spidrv_inited = true;
    APP_DEBUG_PRINTF("SPI flash: SPIDRV exp init (handle=%p)\n",
                     (void *)sl_spidrv_exp_handle);
#ifdef SL_SPIDRV_EXP_PERIPHERAL
    USART_TypeDef *periph = SL_SPIDRV_EXP_PERIPHERAL;
    const char *periph_name = "USART?";
    if (periph == USART0) {
      periph_name = "USART0";
    } else if (periph == USART1) {
      periph_name = "USART1";
    }
    APP_DEBUG_PRINTF("SPI flash: %s ROUTELOC0=0x%08lX ROUTEPEN=0x%08lX\n",
                     periph_name,
                     (unsigned long)periph->ROUTELOC0,
                     (unsigned long)periph->ROUTEPEN);
#endif
#ifdef SL_SPIDRV_EXP_TX_LOC
    APP_DEBUG_PRINTF("SPI flash: SPIDRV loc tx=%u rx=%u clk=%u\n",
                     (unsigned)SL_SPIDRV_EXP_TX_LOC,
                     (unsigned)SL_SPIDRV_EXP_RX_LOC,
                     (unsigned)SL_SPIDRV_EXP_CLK_LOC);
#endif
  }

  if (!app_flash_probe_with_cs(gpioPortB, 11, "PB11")) {
    APP_DEBUG_PRINTF("SPI flash: no response on PB11\n");
  }
}

static void app_flash_enable_init(void)
{
  static bool configured = false;
  if (configured) {
    return;
  }
  // ICC-1 exposes PF3; ICC-A-1 uses PF3 internally to enable the SPI flash.
  GPIO_PinModeSet(gpioPortF, 3, gpioModePushPull, 1);
  APP_DEBUG_PRINTF("SPI flash: enable PF3=1\n");
  configured = true;
}

static void app_flash_send_cmd(GPIO_Port_TypeDef port,
                               unsigned int pin,
                               uint8_t cmd)
{
  app_flash_enable_init();
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);
  uint8_t tx[1] = {cmd};
  GPIO_PinOutClear(port, pin);
  (void)SPIDRV_MTransmitB(sl_spidrv_exp_handle, tx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
}

static bool app_flash_probe_with_cs(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label)
{
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);

  app_flash_send_cmd(port, pin, 0xFF); // Release from continuous read (safe no-op)
  app_flash_send_cmd(port, pin, 0xAB); // Release from deep power-down
  app_flash_send_cmd(port, pin, 0x66); // Reset enable
  app_flash_send_cmd(port, pin, 0x99); // Reset memory
  sl_sleeptimer_delay_millisecond(1);

  uint8_t tx[4] = {0x9F, 0x00, 0x00, 0x00};
  uint8_t rx[4] = {0};

  GPIO_PinOutClear(port, pin);
  Ecode_t status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
  if (status != ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: JEDEC read failed (%s, 0x%lx)\n",
                     label,
                     (unsigned long)status);
    return false;
  }

  APP_DEBUG_PRINTF("SPI flash: JEDEC ID %02X %02X %02X (%s)\n",
                   rx[1],
                   rx[2],
                   rx[3],
                   label);

  tx[0] = 0x05; // Read Status Register-1
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR1=0x%02X (%s)\n", rx[1], label);
  }

  tx[0] = 0x35; // Read Status Register-2
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR2=0x%02X (%s)\n", rx[1], label);
  }

  return !((rx[1] == 0x00 && rx[2] == 0x00 && rx[3] == 0x00)
           || (rx[1] == 0xFF && rx[2] == 0xFF && rx[3] == 0xFF));
}


/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
#if APP_DEBUG_SPI_ONLY
  (void)status;
  return;
#endif
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
    if (!app_join_awake_active) {
      sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = true;
      app_join_awake_start_tick = sl_sleeptimer_get_tick_count();
      APP_DEBUG_PRINTF("Debug: keeping EM0 for %lu ms after join\n",
                       (unsigned long)APP_DEBUG_AWAKE_AFTER_JOIN_MS);
    }
#endif

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetShortPollIntervalMsCallback((int16u)APP_DEBUG_FAST_POLL_INTERVAL_MS);
    emberAfSetWakeTimeoutMsCallback((int16u)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS);
    APP_DEBUG_PRINTF("Debug: fast poll enabled for %lu ms (short=%lu ms)\n",
                     (unsigned long)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS,
                     (unsigned long)APP_DEBUG_FAST_POLL_INTERVAL_MS);
#endif

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
    rejoin_after_leave_request = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

    // Schedule LED to turn off after 3 seconds to save power
    sl_zigbee_event_set_delay_ms(&led_off_event, 3000);
#endif

    // TEMP DEBUG: post-join sensor/report path is disabled to isolate FLT resets.
    // Join/interview must remain stable first; sensor reporting can be re-enabled after.
    emberAfCorePrintln("Debug: post-join sensor/report disabled");

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    emberAfCorePrintln("Network down - will attempt optimized rejoin");

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

