faronov/efr32mg1p-zigbee-sensor/app.c
    // Sensor timer will automatically stop reading when event handler checks network state
    // Device will use minimal power while waiting for network

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);

    if (rejoin_after_leave_request) {
      rejoin_after_leave_request = false;
      emberAfCorePrintln("Long press: network left, starting rejoin");
      handle_short_press();
    }
  }
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
          button_long_press_pending = true;
        } else {
          button_short_press_pending = true;
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfTickCallback(void)
{
  static uint32_t last_heartbeat_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
  // Simple button is configured in poll mode on this board; poll here so
  // sl_button_on_change() is invoked reliably.
  sl_simple_button_poll_instances();
#if (APP_DEBUG_POLL_BUTTON == 0)
  // Fallback path: some TRADFRI revisions do not trigger on_change reliably.
  // Poll raw BTN0 (PB13, active low) and synthesize press events with debounce.
  bool raw_pressed = (GPIO_PinInGet(gpioPortB, 13) == 0);
  if (raw_pressed && !btn0_fallback_pressed) {
    btn0_fallback_pressed = true;
    btn0_fallback_press_tick = now;
  } else if (!raw_pressed && btn0_fallback_pressed) {
    btn0_fallback_pressed = false;
    uint32_t duration_ms = sl_sleeptimer_tick_to_ms(now - btn0_fallback_press_tick);
    if (duration_ms >= BUTTON_DEBOUNCE_MS) {
      if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
        button_long_press_pending = true;
      } else {
        button_short_press_pending = true;
      }
    }
    btn0_fallback_press_tick = 0;
  }
#endif
#endif

  app_debug_poll();

#if APP_DEBUG_SPI_ONLY
  if (button_short_press_pending) {
    button_short_press_pending = false;
    APP_DEBUG_PRINTF("Button short press\n");
    app_flash_probe();
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    APP_DEBUG_PRINTF("Button long press\n");
    app_flash_probe();
  }
  return;
#endif

  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting\n");
    handle_short_press();
  }

  if (last_heartbeat_tick == 0 ||
      sl_sleeptimer_tick_to_ms(now - last_heartbeat_tick) >= 5000) {
    last_heartbeat_tick = now;
    APP_DEBUG_PRINTF("Heartbeat: net=%d join_in_progress=%d\n",
                     emberAfNetworkState(),
                     network_join_in_progress);
    if (APP_DEBUG_DIAG_ALWAYS) {
      EmberNetworkStatus state = emberAfNetworkState();
      APP_DEBUG_PRINTF("Zigbee state=%d, joined=%d\n",
                       state,
                       (state == EMBER_JOINED_NETWORK));
    }
  }

  // Check for short press
#if !APP_DEBUG_POLL_BUTTON
  if (button_short_press_pending) {
    button_short_press_pending = false;  // Clear flag
    APP_DEBUG_PRINTF("Button short press\n");
    emberAfCorePrintln("Button: Short press detected (tick callback)");
    handle_short_press();
  }

  // Check for long press
  if (button_long_press_pending) {
    button_long_press_pending = false;  // Clear flag
    APP_DEBUG_PRINTF("Button long press\n");
    emberAfCorePrintln("Button: Long press detected (tick callback)");
    handle_long_press();
  }
#endif
}

/**
 * @brief Optimized rejoin retry event handler
 *
 * Manages the rejoin state machine:
 * 1. Try current channel first (fast path)
 * 2. If timeout, try all channels (fallback)
 */
static void rejoin_retry_event_handler(sl_zigbee_event_t *event)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
  (void)event;  // Unused parameter
}

/**
 * @brief Start optimized rejoin - try current channel first
 *
 * Optimization: Attempt rejoin on previously-used channel first for fast
 * reconnection (~138ms vs ~2.2s). Falls back to full channel scan after
 * timeout if current channel doesn't respond.
 *
 * Benefits:
 * - 7x faster rejoin when successful (typical case)
 * - ~85% power savings for successful rejoins
 * - Graceful fallback to full scan if network changed
 */
static void start_optimized_rejoin(void)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
}

/**
 * @brief Try next channel in the scan sequence
 *
 * Move to next channel and attempt join. If all channels exhausted,
 * report failure and stop scanning.
 */
static void try_next_channel(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

